<template>
  <div id="subComments">
    <h2>最新短评论</h2>
    <div class="review-container">
      <div
        class="content"
        v-for="item in comments"
        :key="item.id"
      >{{ item.short==null?item.full:item.short }}</div>
    </div>
  </div>
</template>

<script>
export default {
  data() {
    return {
      comments: [
        {
          id: 0,
          short:
            "你们知道凌晨两点半，看完《惊奇队长》回家在楼道里遇到一只橘猫的感受吗？"
        },
        {
          id: 1,
          full:
            "没想到还有这么多停留在春晚选花魁的审美，也活该养出次方AB和海量烂片。觉得女主有问题的拜托去看印度歌舞片和DC海王好吗？反正我从定妆照开始就觉得很有代入感，超级英雄又不是超级整容，这角色之前就是普通人，反而更凸显超能力带来的变化，marvel精神本就是普通人也可以成长为英雄；如果本来就是个引入注目的精致花瓶发型一丝不苟打一下看着就要坏了对这个角色塑造又有什么意义？文艺片出身的女主更让漫威电影有史诗感！"
        },
        {
          id: 2,
          full:
            "漫威电影正常发挥吧，不用指望有什么惊喜，也算不上很差。这部最大的意义还是必须在四月末的复联决战之前，把惊奇队长这个角色引出来。毕竟，这个战斗力如此强大的女人，在最后大战还是要发挥重要作用的。一点点小幽默，一点点复古感，再加上寇森与年轻版弗瑞这样的老友重逢，看了这么多年复联连续剧的大家，总会有些小触动。不过也仅限于此了。没有任何惊喜的温吞故事与算不上很突出的角色设定。虽然是漫威首部女超级英雄电影，却在其个性和超能力对其影响少，讨论极其有限。裘德洛的角色也接近废角色。当热闹看吧，反正，这部也只是终集的铺垫。另外。她太强了，结尾大战更像是打杂兵。值得关注的还有：定制版斯坦·李纪念片头，结尾必不可少的双彩蛋，以及人人都在夸的萌猫。"
        },
        {
          id: 3,
          full:
            "又是“看彩蛋送电影”，第一个彩蛋比正片好看。\n斯克鲁人怕猫，克里人怕尬舞，养只尬舞的猫可以称霸宇宙。\n斯坦·李上一次在公交车上看书遇到奇异博士，这次在地铁上看书又遇惊奇队长。\n所以说啊，年轻人没事不要总是宅在家里，多去公交车、地铁上看看书，搞不好能超级英雄呢。\n打飞船一幕竟然有种《三体》的水滴的感觉。\n我已经隐隐约约猜到《复联4》的剧了，噬元兽眼看有个紫薯精竟然敢抢它的宇宙魔方，把他吃了再说！\n毕竟猫才是复联最强的超级雄。\n想知道如果把咕咕和贝爷关在同一个房间，谁能活下来。"
        },
        {
          id: 4,
          full:
            "妇女节献礼电影。//本片解答了数个起源问题。很高兴又在荧幕见到Stan老爷子（片头也有致敬，鼓了个掌）和李佩斯。女队长戴上面具的莫西干发型我就不吐槽了，满血还是很能打。你以为惊奇队长就是MVP，那你是没养过橘猫。立flag秒拔是好习惯。片尾有一对儿彩蛋，对接复联4。//弱项剧情，毕竟单个英雄起源不如多人互动好看，剧本有点东拼西凑：开头一小会儿像星际迷航，然后像火星救援，之后是谍影重重，接着国家地理之大峡谷，最后居然是星际穿越。//今年几部院线电影评论区都是站队用的么。"
        }
      ]
    };
  }
};
</script>

<style lang="less" scoped>
@import url('../assets/style/colors.less');
#subComments {
  margin-top: 2rem;
  .content {
    margin: 2rem 0;
    padding: 3rem 2rem;
    box-shadow: @depth2;
    border-left: 2px solid @default-color;
    border-radius: 5px;
    transition: 0.3s;
    background-color: #fff;
    &:hover{
      box-shadow: @depth3;
    }
  }
}
</style>

